{
    "architectures": [
      "BertForDiacritization"
    ],
    "auto_map": {
      "AutoModel": "BertForDiacritization.BertForDiacritization"
    },
    "attention_probs_dropout_prob": 0.1,
    "classifier_dropout": null,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.1,
    "hidden_size": 1024,
    "initializer_range": 0.02,
    "intermediate_size": 4096,
    "layer_norm_eps": 1e-12,
    "mat_lect_token": "<MAT_LECT>",
    "max_position_embeddings": 2048,
    "model_type": "bert",
    "nikud_classes": [
      "",
      "<MAT_LECT>",
      "\u05bc",
      "\u05b0",
      "\u05b1",
      "\u05b2",
      "\u05b3",
      "\u05b4",
      "\u05b5",
      "\u05b6",
      "\u05b7",
      "\u05b8",
      "\u05b9",
      "\u05ba",
      "\u05bb",
      "\u05bc\u05b0",
      "\u05bc\u05b1",
      "\u05bc\u05b2",
      "\u05bc\u05b3",
      "\u05bc\u05b4",
      "\u05bc\u05b5",
      "\u05bc\u05b6",
      "\u05bc\u05b7",
      "\u05bc\u05b8",
      "\u05bc\u05b9",
      "\u05bc\u05ba",
      "\u05bc\u05bb",
      "\u05c7",
      "\u05bc\u05c7"
    ],
    "num_attention_heads": 16,
    "num_hidden_layers": 24,
    "pad_token_id": 0,
    "position_embedding_type": "absolute",
    "shin_classes": [
      "\u05c1",
      "\u05c2"
    ],
    "torch_dtype": "float32",
    "transformers_version": "4.42.4",
    "type_vocab_size": 2,
    "use_cache": true,
    "vocab_size": 1024
  }